{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire2_squeeze1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire2_squeeze1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire2_squeeze1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire2_relu_squeeze1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire2_expand1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire2_expand1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire2_expand1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire2_relu_expand1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire2_expand3x3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire2_expand3x3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire2_expand3x3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[9, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire2_relu_expand3x3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "fire2_concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[13, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire3_squeeze1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire3_squeeze1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire3_squeeze1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire3_relu_squeeze1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire3_expand1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire3_expand1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire3_expand1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire3_relu_expand1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire3_expand3x3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire3_expand3x3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire3_expand3x3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[22, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire3_relu_expand3x3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "fire3_concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[26, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire4_squeeze1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire4_squeeze1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire4_squeeze1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire4_relu_squeeze1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire4_expand1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire4_expand1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire4_expand1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire4_relu_expand1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire4_expand3x3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire4_expand3x3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire4_expand3x3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[36, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire4_relu_expand3x3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "fire4_concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[40, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire5_squeeze1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire5_squeeze1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire5_squeeze1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire5_relu_squeeze1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire5_expand1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire5_expand1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire5_expand1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire5_relu_expand1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire5_expand3x3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire5_expand3x3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire5_expand3x3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[49, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire5_relu_expand3x3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "fire5_concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[53, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool5", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire6_squeeze1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire6_squeeze1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire6_squeeze1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire6_relu_squeeze1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire6_expand1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire6_expand1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire6_expand1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire6_relu_expand1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire6_expand3x3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire6_expand3x3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire6_expand3x3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[63, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire6_relu_expand3x3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "fire6_concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[67, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire7_squeeze1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire7_squeeze1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire7_squeeze1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire7_relu_squeeze1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire7_expand1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire7_expand1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire7_expand1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire7_relu_expand1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire7_expand3x3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire7_expand3x3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire7_expand3x3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[76, 0, 0], [81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire7_relu_expand3x3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "fire7_concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[80, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire8_squeeze1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire8_squeeze1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire8_squeeze1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire8_relu_squeeze1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire8_expand1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire8_expand1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire8_expand1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire8_relu_expand1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire8_expand3x3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire8_expand3x3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire8_expand3x3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[89, 0, 0], [94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire8_relu_expand3x3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "fire8_concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[93, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire9_squeeze1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire9_squeeze1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire9_squeeze1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire9_relu_squeeze1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire9_expand1x1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire9_expand1x1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire9_expand1x1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire9_relu_expand1x1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fire9_expand3x3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fire9_expand3x3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fire9_expand3x3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[102, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fire9_relu_expand3x3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "fire9_concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[106, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "drop9", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv10_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv10_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv10", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "1000", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv10", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool10", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(1,1)", 
        "pad": "(0,0)", 
        "pool_type": "avg", 
        "pooling_convention": "full", 
        "stride": "(1,1)"
      }, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "new_fully_connected_layer_weight", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "5"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "new_fully_connected_layer_bias", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "5"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "new_fully_connected_layer", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "5"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prob_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "prob", 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    6, 
    7, 
    10, 
    11, 
    14, 
    15, 
    19, 
    20, 
    23, 
    24, 
    27, 
    28, 
    33, 
    34, 
    37, 
    38, 
    41, 
    42, 
    46, 
    47, 
    50, 
    51, 
    54, 
    55, 
    60, 
    61, 
    64, 
    65, 
    68, 
    69, 
    73, 
    74, 
    77, 
    78, 
    81, 
    82, 
    86, 
    87, 
    90, 
    91, 
    94, 
    95, 
    99, 
    100, 
    103, 
    104, 
    107, 
    108, 
    113, 
    114, 
    118, 
    119, 
    121
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124
  ], 
  "heads": [[122, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}